sa3mv3g/jerry/application/bsp/stm/stm32h563/NonSecure/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"
#include "stm32h5xx_nucleo.h"
#include <stdio.h>

#include "stm32h5xx_ll_crc.h"
#include "stm32h5xx_ll_bus.h"
#include "stm32h5xx_ll_cortex.h"
#include "stm32h5xx_ll_rcc.h"
#include "stm32h5xx_ll_system.h"
#include "stm32h5xx_ll_utils.h"
#include "stm32h5xx_ll_pwr.h"
#include "stm32h5xx_ll_gpio.h"
#include "stm32h5xx_ll_dma.h"

#include "secure_nsc.h" /* For export Non-secure callable APIs */
#include "stm32h5xx_ll_exti.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
extern ADC_HandleTypeDef  hadc1;
extern DMA_NodeTypeDef    Node_GPDMA1_Channel0;
extern DMA_QListTypeDef   List_GPDMA1_Channel0;
extern DMA_HandleTypeDef  handle_GPDMA1_Channel0;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);
void MX_GPIO_Init(void);
void MX_GPDMA1_Init(void);
void MX_GTZC_NS_Init(void);
void MX_ETH_Init(void);
void MX_USB_HCD_Init(void);
void MX_ADC1_Init(void);
void MX_LPUART1_UART_Init(void);
void MX_TIM1_Init(void);
void MX_IWDG_Init(void);
void MX_I2C4_Init(void);
void MX_TIM7_Init(void);
void MX_CRC_Init(void);

/* USER CODE BEGIN EFP */
void ethernetif_get_mac_addr(uint8_t *mac_addr);

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MX_I2C3_PERIPH_CLOCK_FREQ 10
#define MX_SPI1_PERIPH_CLOCK_FREQ 976562
#define DI4_Pin GPIO_PIN_0
#define DI4_GPIO_Port GPIOF
#define DI3_Pin GPIO_PIN_1
#define DI3_GPIO_Port GPIOF
#define DI2_Pin GPIO_PIN_2
#define DI2_GPIO_Port GPIOF
#define DI0_Pin GPIO_PIN_7
#define DI0_GPIO_Port GPIOF
#define DI1_Pin GPIO_PIN_9
#define DI1_GPIO_Port GPIOF
#define STLK_MCO_Pin GPIO_PIN_0
#define STLK_MCO_GPIO_Port GPIOH
#define RMII_MDC_Pin GPIO_PIN_1
#define RMII_MDC_GPIO_Port GPIOC
#define RMII_REF_CLK_Pin GPIO_PIN_1
#define RMII_REF_CLK_GPIO_Port GPIOA
#define RMII_MDIO_Pin GPIO_PIN_2
#define RMII_MDIO_GPIO_Port GPIOA
#define VBUS_SENSE_Pin GPIO_PIN_4
#define VBUS_SENSE_GPIO_Port GPIOA
#define RMII_CRS_DV_Pin GPIO_PIN_7
#define RMII_CRS_DV_GPIO_Port GPIOA
#define RMII_RXD0_Pin GPIO_PIN_4
#define RMII_RXD0_GPIO_Port GPIOC
#define RMII_RXD1_Pin GPIO_PIN_5
#define RMII_RXD1_GPIO_Port GPIOC
#define DI7_Pin GPIO_PIN_0
#define DI7_GPIO_Port GPIOG
#define EN_AMPLIFIER_Pin GPIO_PIN_1
#define EN_AMPLIFIER_GPIO_Port GPIOG
#define DEVADDR3_Pin GPIO_PIN_11
#define DEVADDR3_GPIO_Port GPIOE
#define DEVADDR1_Pin GPIO_PIN_13
#define DEVADDR1_GPIO_Port GPIOE
#define DEVADDR2_Pin GPIO_PIN_14
#define DEVADDR2_GPIO_Port GPIOE
#define RMII_TXD1_Pin GPIO_PIN_15
#define RMII_TXD1_GPIO_Port GPIOB
#define USB_FS_N_Pin GPIO_PIN_11
#define USB_FS_N_GPIO_Port GPIOA
#define USB_FS_P_Pin GPIO_PIN_12
#define USB_FS_P_GPIO_Port GPIOA
#define DI5_Pin GPIO_PIN_0
#define DI5_GPIO_Port GPIOD
#define DI6_Pin GPIO_PIN_1
#define DI6_GPIO_Port GPIOD
#define RMII_TXT_EN_Pin GPIO_PIN_11
#define RMII_TXT_EN_GPIO_Port GPIOG
#define RMI_TXD0_Pin GPIO_PIN_13
#define RMI_TXD0_GPIO_Port GPIOG
#define DEVADDR0_Pin GPIO_PIN_14
#define DEVADDR0_GPIO_Port GPIOG
#define ARD_D1_TX_Pin GPIO_PIN_6
#define ARD_D1_TX_GPIO_Port GPIOB
#define ARD_D0_RX_Pin GPIO_PIN_7
#define ARD_D0_RX_GPIO_Port GPIOB
#define I2C4_SCL_Pin GPIO_PIN_8
#define I2C4_SCL_GPIO_Port GPIOB
#define I2C4_SDA_Pin GPIO_PIN_9
#define I2C4_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
